#include  <iostream>
using namespace std;
int main() {
	//Integer1◦.Дано расстояние L в сантиметрах.Используя операцию деления нацело, найти количество полных метров в нем(1 метр = 100 см).
	//int L, m;
	//cin >> L;
	//m = L / 100;
		//cout << m << endl;
	//Integer2◦	. Дана масса M в килограммах.Используя операцию деления нацело, найти количество полных тонн в ней(1 тонна = 1000 кг).
	//int m, t;
	//cin >> m;
	//t = m / 1000;
	//cout << t << endl; 
	//Integer3◦ . Дан размер файла в байтах.Используя операцию деления нацело, найти количество полных килобайтов, которые занимает данный файл (1 килобайт = 1024 байта).
	//int k, b;
	//cin >> k;
	//b = k / 1024;
	//cout << b << endl;
	//Integer4◦	. Даны целые положительные числа A и B(A > B).На отрезке длины A размещено максимально возможное количество отрезков длины B  
	//(без наложений).Используя операцию деления нацело, найти количество
	//отрезков B, размещенных на отрезке A.
	//int a, b, k;
	//cin >> a >> b;
	//k = a / b;
	//cout << k << endl;
	//Integer5◦	. Даны целые положительные числа A и B(A > B).На отрезке длины A
	//размещено максимально возможное количество отрезков длины B(без
	//наложений).Используя операцию взятия остатка от деления нацело, найти
	//длину незанятой части отрезка A.
	//int a, b, c;
	//cin >> a >> b;
	//c = a % b;
	//cout >> c >> endl; 
	//Integer6◦	. Дано двузначное число.Вывести вначале его левую цифру(десятки), а затем — его правую цифру(единицы).Для нахождения десятков
	//использовать операцию деления нацело, для нахождения единиц — операцию взятия остатка от деления.
	int n;
	cin >> n;
	n % 10;
	cout >> n >> endl;


		return 0;

}